Revit 2027 API
RebarConstrainedHandle.GetRebarConstraintsManager Method
 Gets the RebarConstraintsManager that is associated with this handle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstraintsManager GetRebarConstraintsManager()
Public Function GetRebarConstraintsManager As RebarConstraintsManager
public:
RebarConstraintsManager^ GetRebarConstraintsManager()
member GetRebarConstraintsManager : unit -> RebarConstraintsManager
Return Value
RebarConstraintsManager
 Return the RebarConstraintsManager that is associated with this handle.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace